icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
 //implementation of itoa from (http://www.jb.man.ac.uk/~slowe/cpp/itoa.html)
char* itoa(int val, int base){
	
	static char buf[32] = {0};
	
	int i = 30;
	
	for(; val && i ; --i, val /= base)
	
		buf[i] = "0123456789abcdef"[val % base];
	
	return &buf[i+1];
	
}


 //*****************************************************************************
//
// Display the interrupt state on the LCD.  The currently active and pending
// interrupts are displayed.
//
//*****************************************************************************
// mthomas: added static
static void DisplayIntStatus(void)
{
    unsigned long ulTemp;
    char pcBuffer[4];

    //
    // Display the currently active interrupts.
    //
    ulTemp = HWREG(NVIC_ACTIVE0);
    pcBuffer[0] = (ulTemp & 1) ? '1' : ' ';
    pcBuffer[1] = (ulTemp & 2) ? '2' : ' ';
    pcBuffer[2] = (ulTemp & 4) ? '3' : ' ';
    pcBuffer[3] = '\0';
	RIT128x96x4Clear();
    RIT128x96x4StringDraw(pcBuffer, 12,16,15);
	
    //
    // Display the currently pending interrupts.
    //
    ulTemp = HWREG(NVIC_PEND0);
    pcBuffer[0] = (ulTemp & 1) ? '1' : ' ';
    pcBuffer[1] = (ulTemp & 2) ? '2' : ' ';
    pcBuffer[2] = (ulTemp & 4) ? '3' : ' ';
    RIT128x96x4StringDraw(pcBuffer, 12,24,15);
}


//*****************************************************************************
//
// Delay for the specified number of seconds.  Depending upon the current
// SysTick value, the delay will be between N-1 and N seconds (i.e. N-1 full
// seconds are guaranteed, along with the remainder of the current second).
//
//*****************************************************************************
// mthomas: added static 
static void Delay(unsigned long ulSeconds)
{
    //
    // Loop while there are more seconds to wait.
    //
    while(ulSeconds--)
    {
        //
        // Wait until the SysTick value is less than 1000.
        //
        while(SysTickValueGet() > 1000)
        {
        }

        //
        // Wait until the SysTick value is greater than 1000.
        //
        while(SysTickValueGet() < 1000)
        {
        }
    }
}


//*****************************************************************************
//
// The interrupt handler for the SystemTick
//
//*****************************************************************************
void SysTickHandler(void)
{
  //what should I do to clear the SysTick Interrupt?
  //does it not need to be cleared?

  //RIT128x96x4StringDraw("in systick handler",            12,  0, 15);
  
   seconds++;

}

//*****************************************************************************
//
// The interrupt handler for the first timer interrupt.
// Time0 counts down until we are safe to process.
// FIXME: make sure only one timer0 runs at a time.
//
//*****************************************************************************
// mthomas: attribute for stack-aligment (see README_mthomas.txt)
//#ifdef __GNUC__
//void Timer0IntHandler(void) __attribute__((__interrupt__));
//#endif
void Timer0IntHandler(void)
{
    //
    // Clear the timer interrupt.
    //
    TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
//	RIT128x96x4Clear();
	if (timerInterruptTimes > 0) {
		timerInterruptTimes--;
		return;
	}

	//
	//Setup the interrupts for the timer timeouts
	//
	TimerDisable(TIMER0_BASE, TIMER_BOTH);
    IntDisable(INT_TIMER0A);
	IntDisable(INT_TIMER0B);
	//FIXME: is this correct?
	TimerIntDisable(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
	TimerIntDisable(TIMER0_BASE, TIMER_TIMB_TIMEOUT);
    // Disable the timers.
    //

    //
    // Update the interrupt status on the display.
    //
    /*IntMasterDisable();
	//eightmicroseconds++;
  	if(tenthofsecond == 10)
  	{
   		seconds++;	/// if seconds are incremented here we'll have to limit the granularity
   		tenthofsecond = 0;
  	}
	  */
/*	nanoseconds++;
	if(nanoseconds == 100000000)
	{
	seconds ++;
	nanoseconds = 0;
	RIT128x96x4StringDraw("seconds ",        12, 36, 15);
	RIT128x96x4StringDraw(itoa(seconds,10),  50, 36, 15);
	}	*/
    //RIT128x96x4StringDraw(HWREGBITW(&g_ulFlags, 0) ? "1" : "0",        12, 36, 15);
	
    //IntMasterEnable();
	// FIXME: is this needed here?
	// If we set sources as the lowest priorities, then we'll always be able to process within this
	// interrupt service routine, so this wouldn't be needed... correct?
	STOP_SOURCE_PROCESS = TRUE;
	processAvailableEvents();
	return;
}

//*****************************************************************************
//
// The interrupt handler for the second timer interrupt.
//
//*****************************************************************************
// mthomas: attribute for stack-aligment (see README_mthomas.txt)
//#ifdef __GNUC__
//void Timer1IntHandler(void) __attribute__((__interrupt__));
//#endif
void Timer1IntHandler(void)
{
    //
    // Clear the timer interrupt.
    //
    TimerIntClear(TIMER1_BASE, TIMER_TIMA_TIMEOUT);
    // RIT128x96x4Clear();
    //
    // Toggle the flag for the second timer.
    //
    HWREGBITW(&g_ulFlags, 1) ^= 1;

    //
    // Update the interrupt status on the display.
    //
  //  IntMasterDisable();
//	modeltime++;
    //RIT128x96x4StringDraw(HWREGBITW(&g_ulFlags, 1) ? "1" : "0",        12, 48, 15);
//	RIT128x96x4StringDraw("modeltime ",        12, 48, 15);
//	RIT128x96x4StringDraw(itoa(modeltime,10),  50, 48, 15);
    //IntMasterEnable();
}


////*****************************************************************************
////
//// This is the handler for INT_GPIOA.  It simply saves the interrupt sequence
//// number.
////
////*****************************************************************************
//void IntGPIOa(void)
//{
//    //
//    // Set PB0 high to indicate entry to this interrupt handler.
//    //
//    GPIOPinWrite(GPIO_PORTD_BASE, GPIO_PIN_0, GPIO_PIN_0);
//
//    //
//    // Put the current interrupt state on the LCD.
//    //
//    DisplayIntStatus();
//
//    //
//    // Wait two seconds.
//    //
//    Delay(2);
//
//    //
//    // Save and increment the interrupt sequence number.
//    //
//    g_ulGPIOa = g_ulIndex++;
//
//    //
//    // Set PB0 low to indicate exit from this interrupt handler.
//    //
//    GPIOPinWrite(GPIO_PORTD_BASE, GPIO_PIN_0, 0);
//}
//
////*****************************************************************************
////
//// This is the handler for INT_GPIOB.  It triggers INT_GPIOA and saves the
//// interrupt sequence number.
////
////*****************************************************************************
//
//void IntGPIOb(void)
//{
//    //
//    // Set PB1 high to indicate entry to this interrupt handler.
//    //
//    GPIOPinWrite(GPIO_PORTD_BASE, GPIO_PIN_1, GPIO_PIN_1);
//
//    //
//    // Put the current interrupt state on the LCD.
//    //
//    DisplayIntStatus();
//
//    //
//    // Trigger the INT_GPIOA interrupt.
//    //
//    HWREG(NVIC_SW_TRIG) = INT_GPIOA - 16;
//
//    //
//    // Put the current interrupt state on the LCD.
//    //
//    DisplayIntStatus();
//
//    //
//    // Wait two seconds.
//    //
//    Delay(2);
//
//    //
//    // Save and increment the interrupt sequence number.
//    //
//    g_ulGPIOb = g_ulIndex++;
//
//    //
//    // Set PB1 low to indicate exit from this interrupt handler.
//    //
//    GPIOPinWrite(GPIO_PORTD_BASE, GPIO_PIN_1, 0);
//}
//
////*****************************************************************************
////
//// This is the handler for INT_GPIOC.  It triggers INT_GPIOB and saves the
//// interrupt sequence number.
////
////*****************************************************************************
//void IntGPIOc(void)
//{
//    //
//    // Set PB2 high to indicate entry to this interrupt handler.
//    //
//    GPIOPinWrite(GPIO_PORTD_BASE, GPIO_PIN_2, GPIO_PIN_2);
//
//    //
//    // Put the current interrupt state on the LCD.
//    //
//    DisplayIntStatus();
//
//    //
//    // Trigger the INT_GPIOB interrupt.
//    //
//    HWREG(NVIC_SW_TRIG) = INT_GPIOB - 16;
//
//    //
//    // Put the current interrupt state on the LCD.
//    //
//    DisplayIntStatus();
//
//    //
//    // Wait two seconds.
//    //
//    Delay(2);
//
//    //
//    // Save and increment the interrupt sequence number.
//    //
//    g_ulGPIOc = g_ulIndex++;
//
//    //
//    // Set PB2 low to indicate exit from this interrupt handler.
//    //
//    GPIOPinWrite(GPIO_PORTD_BASE, GPIO_PIN_2, 0);
//}


//*****************************************************************************
//
// Send a string to the UART.
//
//*****************************************************************************
//void UARTSend(const unsigned char *pucBuffer, unsigned long ulCount)
//{
//    //
//    // Loop while there are more characters to send.
//    //
//    while(ulCount--)
//    {
//        //
//        // Write the next character to the UART.
//        //
//        UARTCharPutNonBlocking(UART0_BASE, *pucBuffer++);
//    }
//}

 /**
 * This is the fire method for actuator
 * The actuator is used to check if the event received output has met the 
 * deadline by comparing the current time with the timestamp.
 * Note that it actually use the hardware to do the actuation.
 * Note that this actually is not a terminating actor, actuation is not done in
 * this method, instead, it's done by actuator_run().
 * Since it's not a terminating actor, the event is not popped.
 *
 */
void fireActuator(Actor* this_actuator, Event* thisEvent) 
{
	long long currentTime = getCurrentPhysicalTime();
    Tag *stampedTag = &(thisEvent->Tag);
	 fireActuatorCount++;
	 
    // Compare time with taged time, if not safe to actuate, then add events
    // and wait until time to actuate. If safe to actuate, actuate now.
	if (stampedTag->timestamp > currentTime)
    {
//        printf("\nthe actuator was able to produce event ON TIME!!!! \n");
//        printf("the timestamped tag is: %.9d.%9.9d %i \n", stampedTag->secs, stampedTag->nsecs, stampedTag->microstep);
//        printf("the current time is:    %.9d.%9.9d %i \n", secs, nsecs, microstep);

