icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
		setActuationInterrupt(stampedTag->timestamp);		
	}											   
    else
    {
//        printf("\nthe timing of the system was NOT MET!!!!! \n");
//        printf("the timestamped tag is: %.9d.%9.9d %i \n", stampedTag->secs, stampedTag->nsecs, stampedTag->microstep);
//        printf("the current time is:    %.9d.%9.9d %i \n", secs, nsecs, microstep);

		// FIXME: do something!
    }
  	this_actuator->firing = 0;
	RIT128x96x4StringDraw("actuatorfired", 12,60,15);
	sprintf(str,"%d",fireActuatorCount);
	RIT128x96x4StringDraw(str, 90,60,15);	   

}

/**
 * This function should only be called when the interrupt has been disabled
 */
unsigned int alreadyFiring(Actor* actor) {
	return actor->firing;
}

/**
 * This function is basically the same as clock_init(), expect only this 
 * function is called through an event, thus we use addEvent() instead 
 * of event_insert() in this case.
 */
void fireClock(Actor* this_clock, Event* thisEvent) {

	long time = CK1_TIME;
	Event* myNewEvent = newEvent();
	//Event* new_event2;	    
    time += CLOCK_PERIOD;

    //Notice orderTag and realTag are set to different things:
    //since the event queue is ordered by orderTag, we these events to 
	//execute now.
	//However realTag is the real timestamp to appear at the output.
    myNewEvent->thisValue.doubleValue = 0;
    myNewEvent->Tag.timestamp = time;
    myNewEvent->Tag.microstep = 0;   //FIXME
    myNewEvent->actorToFire = this_clock->nextActor1;
    myNewEvent->actorFrom = this_clock;
	myNewEvent->name =2;

    addEvent(myNewEvent);
	CK1_BUF_SIZE++;

    if (this_clock->nextActor2 != NULL) {
        Event* newEvent2 = newEvent();
		*newEvent2 = *myNewEvent;
        newEvent2->actorToFire = this_clock->nextActor2;
        addEvent(newEvent2);
    }
	this_clock->firing=0;
	clockfirecount++;
	RIT128x96x4StringDraw("clockfired", 12,12,15);
	sprintf(str,"%d",clockfirecount);
	RIT128x96x4StringDraw(str, 100,12,15);
    return;
}

/** 
 * This is the initilization for the clock actor.
 * its functionality is to provide events with intervals specified by 
 * CLOCK_PERIOD_SECS/NSECS.
 * At one time, CLOCK_EVNTS number of events are produced at a time, and they 
 * can be executed momentarily.
 * when the deadline of the last event that was produced has passed
 * CLOCK_EVENTS number of events are again produced by a event added into the event queue
 */
void initializeClock(Actor *this_clock)
{
    long long currentTime = getCurrentPhysicalTime();

    Event* myNewEvent = newEvent();				

    //CLOCK_PERIOD specifies the period
    currentTime += CLOCK_PERIOD;   

    //notice orderTag and realTag are set to different things:
    //since the event queue is ordered by orderTag, we these events to execute NOW
    //however realTag is the real timestamp to appear at the output
    myNewEvent->Tag.timestamp = currentTime;
    myNewEvent->Tag.microstep = 0;   //FIXME
    myNewEvent->thisValue.doubleValue = 0;
    myNewEvent->actorToFire = this_clock;//->nextActor1;
    myNewEvent->actorFrom = this_clock;

    addEvent(myNewEvent);

	CK1_TIME = currentTime;
	/*
    if (this_clock->nextActor2 != NULL)
    {
        Event* newEvent2 = newEvent();
		*newEvent2 = *myNewEvent;    
        newEvent2->actorToFire = this_clock->nextActor2;
        addEvent(newEvent2);
    } */
	RIT128x96x4StringDraw("initclock", 12,12,15);
}

/**
 * Set the firing flag of the actor, indicate that the actor is currenting being fired.
 */
void currentlyFiring(Actor* actor) 
{
	actor->firing = 1;
}

/** 
 * This is the fire method for computation.
 * Computation method do not have any real functionality here, where we simply
 * set our event queue to fire the next actor.
 */
void fireComputation(Actor* this_computation, Event* thisEvent) 
{

	double thisDouble;
	Event* myNewEvent = newEvent();
	int computation_delay = 10000;
	fireComputationCount++;
	// I'm not sure if this is the correct think to do but I noticed that 
	// the timestamp wasn't set for the new event that was created
	//RIT128x96x4StringDraw("begincomputationFire",12,  24, 15);

	myNewEvent->Tag.timestamp = thisEvent->Tag.timestamp + computation_delay;
    myNewEvent->Tag.microstep = 0;   //FIXME
    //myNewEvent->actorToFire = this_computation->nextActor1;
    //myNewEvent->actorFrom = this_computation;

	// this may need to be added to the sectoin that adds newEvent2
	//end code I added in hopes that this will work
        
	thisDouble = thisEvent->thisValue.doubleValue;
    thisDouble++;

	myNewEvent->thisValue.doubleValue = thisDouble;
    myNewEvent->actorToFire = this_computation->nextActor1;
    myNewEvent->actorFrom = this_computation;
	//RIT128x96x4StringDraw("1begincomputationFire",12,  24, 15);
    //arbitrarily delay either 1/4 of a sec or 1/2 of a sec or none.
	addEvent(myNewEvent);
	//	RIT128x96x4StringDraw("2begincomputationFire",12,  24, 15);
    if (this_computation->nextActor2 != NULL)
    {
        Event* newEvent2 = newEvent();
		*newEvent2= *myNewEvent;  
        newEvent2->actorToFire = this_computation->nextActor2;
        addEvent(newEvent2);
    }
	this_computation->firing =0 ;
    RIT128x96x4StringDraw("computationFired      ",0,  24, 15);
	sprintf(str,"%d",fireComputationCount);
	RIT128x96x4StringDraw(str, 90,24,15);
//	printf("computation fired\n");
  return;
}

/**
 This function is called when an error occures.
 */
void die(char *mess) { 
	perror(mess); 
	return; 
}

/** 
 * The method addEvent() is only used when an actor that's not the source 
 * within a platform.
 * In this case there's no need to lock the event queue since processEvents() 
 * only execute one event at a time.
 * When events are added, make sure the event queue is ordered by orderTag of the events.
 * Currently, we simply go through the queue one event at a time and check the tags.
 * FIXME: use either binary search or calendar to improve performance.
 */
void addEvent(Event* newEvent)
{
	
    Tag stampedTag = newEvent->Tag;

