icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
    //add an event
    Event *compare_event = EVENT_QUEUE_HEAD;
    Event *before_event  = EVENT_QUEUE_HEAD;
    //move across the link until we find an event with larger tag, or stop at the end.
	addeventcount++;
    while (1)
	{
        if (compare_event == NULL)
		{
			RIT128x96x4StringDraw("ce==null",   12,90,15);
            break;
		}
        else if (stampedTag.timestamp < compare_event->Tag.timestamp)
		{
		    RIT128x96x4StringDraw("opt2",   12,90,15);
            break;
		}
        else if ((stampedTag.timestamp == compare_event->Tag.timestamp) && 
		((stampedTag.microstep < compare_event->Tag.microstep)||(stampedTag.microstep == compare_event->Tag.microstep)))
			{
			RIT128x96x4StringDraw("opt3",   12,90,15);
            break;
			}
        else {
            if (compare_event != before_event)
		        {
				RIT128x96x4StringDraw("inifaddedEvent",   10,90,15);
				before_event = before_event->next;
				
				}
			RIT128x96x4StringDraw("lastelseaddedEvent",   12,90,15);
			
			compare_event = compare_event->next;
			RIT128x96x4StringDraw("22lastelseaddedEvent",   12,90,15);
		//	break;
        }
    }
            
    newEvent->next = compare_event;
	RIT128x96x4StringDraw("check1addedEvent",   12,90,15);
    if (compare_event == before_event)
	{
        EVENT_QUEUE_HEAD = newEvent;
    }
    else if (compare_event != before_event)
	{
        before_event->next = newEvent;
    }
    else {
		RIT128x96x4StringDraw("diedinaddedEvent",   12,90,15);
        die("");
    }
	RIT128x96x4StringDraw("addedEvent          ",   12,90,15);
	sprintf(str,"%d",addeventcount);
	RIT128x96x4StringDraw(str,   90,90,15);

}

/** 
 * removeEvent() is called to pop the most recent event in the event queue.
 * it is not interlocked because it can only be called by sinks within a 
 * platform, which is the called by processEvents().
 * Here the first event on the event queue is popped.
 */
void removeEvent()
{
    if (EVENT_QUEUE_HEAD != NULL)
	{	removecount++;
		//should I call freeEvent(EVENT_QUEUE_HEAD) here? I'm not sure.
		freeEvent(EVENT_QUEUE_HEAD);
        EVENT_QUEUE_HEAD = EVENT_QUEUE_HEAD -> next;
		if(removecount==addeventcount)
		{
		 EVENT_QUEUE_HEAD = NULL;
		}
		//printf("Just removed an event\n");
		RIT128x96x4StringDraw("remEventCount",0,0,15);
		sprintf(str,"%d",removecount);
		RIT128x96x4StringDraw(str,   35,0,15);
    } 
    else printf("event queue is already empty\n");

	
}

/** 
 * execute_event() checks if the event is valid. If it is, then fire actor
 * is called.
 */
void executeEvent(){

    if (EVENT_QUEUE_HEAD == NULL) 
	{
	//	printf("attempting to execute an event but the event queue is empty. I'm going to call die now\n");
        die("EVENT_QUEUE_HEAD should never be NULL\n");
    }
    else 
	{
        if (EVENT_QUEUE_HEAD->actorToFire == NULL)
		{
	//		printf("can't execute b/c actor to fire is null. I'm going to call die now \n");
            die("executing an event where the actors are NULL!!\n");
        }
        else 
		{
	//		printf("about to call fireActor on the event at the beginning of the event queue \n");
            fireActor(EVENT_QUEUE_HEAD);
        }
    }
}

/** 
 * fire_actor checks if static timing analysis is needed.
 * if it is, static timing analysis is called, and returns
 * if it's not, firing method of the actor specified by the event is called
 */
void fireActor(Event* currentEvent)
{
	
    Actor* fire_this = currentEvent->actorToFire;
	//printf("inside fireActor\n");
	//FIXME: USE THIS INSTEAD!! char temp_type[3] = fire_this->type;
	if (fire_this->fireMethod != NULL) 
	{
	//	printf("about to call the fire method of the fireActor \n");
	//	RIT128x96x4StringDraw("abouttofire...", 12, 72, 15);
		(fire_this->fireMethod)(fire_this, currentEvent);
	//	RIT128x96x4StringDraw("justFired", 12, 72, 15);
	} else {
		//printf("actor I'm supposed to fire is null. calling die now. bye \n");
		RIT128x96x4StringDraw("nullfiremethod", 12, 72, 15);
		die("no such method, cannot fire\n");
	}
	fire_this->firing = 0;
	//printf("done firing the actor\n");
    RIT128x96x4StringDraw("endFireActor", 12, 72, 15);
	fireActorCount++;
	sprintf(str,"%d",fireActorCount);
	RIT128x96x4StringDraw(str, 85, 72, 15);
    
}

/** 
 * This is the fire method for merge actor.
 * This firing method transfer the event at the input and put it to the output.
 * It also prints the current timestamp, and which actor it is from.
 * Since it is not a terminating actor, no need to pop event.
 * Only possibility to add event is when it has more than one output.
 * A merge actor may have more than one input.
 */
void fireMerge(Actor* this_merge, Event* thisEvent) 
{

//    printf("THIS IS THE FINAL OUTPUT OF THE MERGE Actor: \n");
//    printf("MAKE SURE THE TagS OF THESE EVENTS ARE IN ORDER: the tag on the current value are: %.9d.%9.9d %i \n", 
//		thisEvent->realTag.secs, thisEvent->Tag.nsecs, thisEvent->Tag.microstep);
//    printf("THIS OUTPUT WAS FROM Actor: %c%c%c\n", 
//		thisEvent->actorFrom->type[0], thisEvent->actorFrom->type[1], thisEvent->actorFrom->type[2]);
	
	Event* myNewEvent = newEvent();
	//printf("inside fireMerge \n");
	*myNewEvent = *thisEvent;	    
    myNewEvent->actorToFire = this_merge->nextActor1;
    myNewEvent->actorFrom = this_merge;


	addEvent(myNewEvent);

    if (this_merge->nextActor2 != NULL)
    {
        Event* newEvent2 = newEvent();
		*newEvent2 = *myNewEvent;     
        newEvent2->actorToFire = this_merge->nextActor2;
        addEvent(newEvent2);
    }
	this_merge->firing = 0;
	fireMergedCount++;
	RIT128x96x4StringDraw("mergeFired", 12,48,15);	   
	sprintf(str,"%d",fireMergedCount);
	RIT128x96x4StringDraw(str, 90,48,15);
	//printf("mergeFired \n");
	return;

}

/** 
 * This is the fire method for model_delay actor.
 * model_delay actor increase the current realTag timestamp by the the 
 * parameter MODEL_DELAY_SECS, where MODEL_DELAY_SECS is greater or equal 
 * to maximum delay from the source of the event to the sink.
 * At the same time, the orderTag is increased by BOUNDED_DELAY, since
 * this is the delay between the sensor actor and the merge actor.
 * Since timestamps are modified in this process, event_pop() and addEvent() 
 * needs to be called.
 * Because model_delay is also a transmitter through the network, socket
 * programming is used.
 */
void fireModelDelay(Actor* this_model_delay, Event* thisEvent) {

	unsigned int model_delay = 0;
/*
	if (this_model_delay ->type[2] == '1') {
		model_delay_secs = MODEL_DELAY1_SECS;
		model_delay_nsecs = MODEL_DELAY1_NSECS;
		bounded_delay_secs = BOUNDED_DELAY1_SECS;
		bounded_delay_nsecs = BOUNDED_DELAY1_NSECS;
	}
	else if (this_model_delay ->type[2] == '2') {
		model_delay_secs = MODEL_DELAY2_SECS;
		model_delay_nsecs = MODEL_DELAY2_NSECS;
		bounded_delay_secs = BOUNDED_DELAY2_SECS;
		bounded_delay_nsecs = BOUNDED_DELAY2_NSECS;
	}
	else if (this_model_delay ->type[2] == '3') {
		model_delay_secs = MODEL_DELAY3_SECS;
		model_delay_nsecs = MODEL_DELAY3_NSECS;
		bounded_delay_secs = BOUNDED_DELAY3_SECS;
		bounded_delay_nsecs = BOUNDED_DELAY3_NSECS;
	}
	else {
		printf("this model delay does not exist!\n");
		exit(1);
	}
*/

	Event* myNewEvent = newEvent();
//	printf("inside fireModelDelay \n");
//RIT128x96x4StringDraw("insidemodelDelayFired", 12,36,15);
	fireModelDelayCount++;	
	myNewEvent->Tag.timestamp = thisEvent->Tag.timestamp + model_delay;
    myNewEvent->Tag.microstep = 0;   //FIXME
    myNewEvent->actorToFire = this_model_delay->nextActor1;
    myNewEvent->actorFrom = this_model_delay;

	addEvent(myNewEvent);
    if (this_model_delay->nextActor2 != NULL)
    {
        Event* newEvent2 = newEvent();
		*newEvent2 = *myNewEvent;   
        newEvent2->actorToFire = this_model_delay->nextActor2;
        addEvent(newEvent2);
    }
    this_model_delay->firing=0;
	RIT128x96x4StringDraw("modelDelayFired", 12,36,15);
	sprintf(str,"%d",fireModelDelayCount);
	RIT128x96x4StringDraw(str, 90,36,15);
//	printf("modelDelayFired");
	 return;
}

/** determines whether the event to fire this current actor is of higher priority than
 * whatever even that's currently being executed.
 * FIXME: other than making sure this actor is not currently firing, we also need to make
 * sure the event to fire is not of higher priority.
 */
unsigned int higherPriority(Actor* actor) {
	return alreadyFiring(actor);
}

