icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
void processEvents()
{
   
    //  To ensure this function is thread safe, we make sure only one processEvents() IS BEING EXECUTED AT A TIME
    //  WHILE ANOTHER SENSOR MIGHT TRIGGER ANOTHER processEvents()
    //  IF ANOTHER processEvents() is currently being executed, we don't really need to have another being executed at the same time...
	Actor* actor;
	int whilecount = 0;
	//RIT128x96x4StringDraw("beginningPE", 12,48,15);
    //printf("at beginning of Process Events");
    while (1) 
	{
				whilecount++;
		sprintf(str,"%d",whilecount);
    	RIT128x96x4StringDraw("topOfWhile", 12,80,15);
		RIT128x96x4StringDraw(str, 90,80,15);
        disableInterrupts();
        // If event queue is not empty.
        		if (EVENT_QUEUE_HEAD != NULL) 
				 {
           			Event* event = EVENT_QUEUE_HEAD;

	                actor = event->actorFrom;
			        // FIXME: since there is only one instance of processing events running, we don't need
			        // the check for alreadyFiring(), in other words, alreadyFiring should always be false.
			        if (alreadyFiring(actor)) 
			        {
				    // not sure what should be in here
				    enableInterrupts();
				    RIT128x96x4StringDraw("alreadyfiring", 0,0,15);
					die("alreadyFiring should always be false within processEvents()");
					break;
					} 
				   else
				   {
				 	 long processTime = safeToProcess(event);
	            	 if (getCurrentPhysicalTime() >= processTime) 
					 {       
	               	  removeEvent();
	               	  enableInterrupts();
	                  fireActor(event);
		      		  freeEvent(event);
	                  // If the event just executed is
	                  // produced by a source actor
	                 /* if (actor->sourceActor != 0) 
					  {
	                    // Decrement the buffer size
	                    // by one.
						if (actor == SOURCE1) 
						{
	                    	CK1_BUF_SIZE--;
						}
	                    // Make sure sourceBuffer is
	                    // non-empty. If it is, fire
	                    // the source actor once to
	                    // produce some events.
	                    if (CK1_BUF_SIZE == 0) 
						{
							//dummyEVent is never used.
							Event* dummyEvent;
	                        fireClock(SOURCE1, dummyEvent);
							// firing of the actor should update the number of events in the buffer
	                    }
	                  }*/
					 }//end if currentPhysicalTime >= processTime
					 else 
			    	{
	                // There are no events safe to
	                // process, so setup sources
	                // to process.
	                STOP_SOURCE_PROCESS = FALSE;
	                // Set timed interrupt to run
	                // the event at the top of the
	                // event queue when physical time
	                // has passed for it to be
	                // safe to process
	                setTimedInterrupt(processTime);
	                enableInterrupts();
	            	}// end !(curentPhysicalTime >= processTime)

					}//end else notalreadyfiring
				 }//end EVENT_QUEUE_HEAD != NULL
				 else 
				 {
           		   // There are no events safe to
            	   // process, so setup sources
            	   // to process.
            	   STOP_SOURCE_PROCESS = FALSE;
            	   enableInterrupts();
        		}
	           
			
		// If there is no event to process and we
        // have not reached the buffer limit, fire
        // the source actor.
        // for (each source actors a) {
        if (STOP_SOURCE_PROCESS == FALSE) 
        {
			if (CK1_BUF_SIZE < MAX_BUFFER_LIMIT) 
             {
		     	Event* dummyEvent;
            	//fireClock(SOURCE1, dummyEvent);   
			}
        }
	   if(EVENT_QUEUE_HEAD == NULL)
	   break;
      
	  }//end while(1)
//		whilecount++;
//		sprintf(str,"%d",whilecount);
//    RIT128x96x4StringDraw("bottomOfWhile", 12,80,15);
//	RIT128x96x4StringDraw(str, 90,80,15);
   //printf("at bottom of while loop in process Events");

}
 
/**
 * This function is almost the same as processEvents, only that this function is called within interrupt service
 * routines. When an event is not safe to process, or alreadyingFiring() is true, we return from this function,
 * instead of waiting for events to process. We also do not deal with source actors within this process
 *
 * Also, maybe we should have a seperate event queue for events generated here...? Depends on what we really want.
 */
processAvailableEvents()
{  // should this be given a parameter for the event that was just created in the ISR that calls this function?
   // I am possibly wrong... but I thought the reason for having this was to check to see if its safe to process the event just generated

    //  To ensure this function is thread safe, we make sure only one processEvents() IS BEING EXECUTED AT A TIME
    //  WHILE ANOTHER SENSOR MIGHT TRIGGER ANOTHER processEvents()
    //  IF ANOTHER processEvents() is currently being executed, we don't really need to have another being executed at the same time...
	Actor* actor;
    while (1) 
	{
        disableInterrupts();
        // If event queue is not empty.
        if (EVENT_QUEUE_HEAD != NULL) 
		{
            Event* event = EVENT_QUEUE_HEAD;
            // Check which actor produced the event that we have processed			
			actor = event->actorFrom;
			// FIXME: ALSO check if an event is of higher priority here.
			if (higherPriority(actor) == 1) {
				enableInterrupts();
				break;
			} 
			else 
			{
	            long processTime = safeToProcess(event);
	            if (getCurrentPhysicalTime() >= processTime) 
				{
	                removeEvent();
					currentlyFiring(actor);
	                enableInterrupts();
	                // Execute the event. During
	                // this process more events may
	                // be posted to the queue.
	                fireActor(event);
					freeEvent(event);
	                // If the event just executed is
	                // produced by a source actor
	                if (actor->sourceActor != 0) {
	                    // Decrement the buffer size
	                    // by one.
						if (actor == SOURCE1) {
	                    	CK1_BUF_SIZE--;
						}
	                    // Make sure sourceBuffer is
	                    // non-empty. If it is, fire
	                    // the source actor once to
	                    // produce some events.
	                    if (CK1_BUF_SIZE == 0) {
							//dummyEVent is never used.
							Event* dummyEvent;
	                        fireClock(SOURCE1, dummyEvent);
							// firing of the actor should update the number of events in the buffer
	                    }
	                }
	            }
	            else {
					// leave it for processEvents() to figure out what to do with source processes.
					enableInterrupts();
					break;
//	                // There are no events safe to
//	                // process, so setup sources
//	                // to process.
//	                STOP_SOURCE_PROCESS = FALSE;
//	                // Set timed interrupt to run
//	                // the event at the top of the
//	                // event queue when physical time
//	                // has passed for it to be
//	                // safe to process
//	                setTimedInterrupt(processTime);
//	                enableInterrupts();
	            }
			}
        } else {
			// leave it for processEvents() to figure out what to do with source processes.
			enableInterrupts();
			break;
//            // There are no events safe to
//            // process, so setup sources
//            // to process.
//            STOP_SOURCE_PROCESS = FALSE;
//            enableInterrupts();
        }
		// leave it for processEvents() to figure out what to do with source processes.
//        // If there is no event to process and we
//        // have not reached the buffer limit, fire
//        // the source actor.
//        // for (each source actors a) {
//        if (STOP_SOURCE_PROCESS == FALSE) {
//			if (CK1_BUF_SIZE < MAX_BUFFER_LIMIT) {
//				Event* dummyEvent;
//            	fireClock(SOURCE1, dummyEvent);
//			}
//        }
    }
} 

/** 
 * This is the initialization method for sensor actor.
 * Initialize the sensor actor to setup receiving function through another 
 * thread, it then create a new event and calls processEvent()
 */
void fireSensor(Actor* this_sensor)     //this listens for the next signal to sense again
{
	long time;
    Event* myNewEvent;
 	myNewEvent = newEvent();
	sensorCount++;
    //get the current time
    time = getCurrentPhysicalTime();

    // Set a time trigger from now

    myNewEvent->Tag.timestamp = time;
    myNewEvent->Tag.microstep = 0;	//FIXEM
    myNewEvent->thisValue.doubleValue = 10*sensorCount;//time;
    myNewEvent->actorToFire = this_sensor->nextActor1;
    myNewEvent->actorFrom = this_sensor;
	
	
    //now put the created event into the queue
    //BUT HOW DO I TRACK THE START OF THE EVENT QUEUE??? --global variable
    addEvent(myNewEvent);
    if (this_sensor->nextActor2 != NULL)
    {
        Event* newEvent2 = newEvent();
		*newEvent2 = *myNewEvent;     
        newEvent2->actorToFire = this_sensor->nextActor2;
       addEvent(newEvent2);
    } 
		RIT128x96x4StringDraw("initsensor", 12,12,15);
		sprintf(str,"%d",sensorCount);
		RIT128x96x4StringDraw(str, 90,12,15);

