icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
 }

/** 
 * Static timing analysis is called to set the timestamp of the event by a 
 * specific amount in order to fire the event at an instance that ensures 
 * all events are exectued in order.
 * In this analysis, the clock event can be executed when real time exceeds
 * tau - model_delay3
 */
long long safeToProcess(Event* thisEvent) 
{
    long long safeTimestamp = thisEvent->Tag.timestamp;

	if (thisEvent->actorToFire->multipleInputs != 0) 
	{
	    if (thisEvent->actorToFire->fireMethod == fireMerge)
		{
			safeTimestamp -= MERGE_MODEL_TIME_ADJUSTMENT; 
		} 
		else if (thisEvent->actorToFire->fireMethod == fireComputation)
	    {        
	    	safeTimestamp -= COMPUTATION_MODEL_TIME_ADJUSTMENT;
		}
    }
	 else 
	 {
//        printf("always safe to execute, so set safeTag to 0\n");
        safeTimestamp = 0;
    }

    return safeTimestamp;
}

// FIXME
void setActuationInterrupt(long long actuationTime) 
{
	return;
}

// FIXME
void setTimedInterrupt(long long safeToProcessTime) 
{
// should I just set the timer interrupt here and go to sleep until I get sensor input or the time had come for the timer to happen?
	//printf("I should set a timer interrupt here \n");
	return;
	
	// If timer already running
	// check if need to reload the interrupt value.
	// If not
	// Set it up to run.
	//set timer0 as a periodic 32 bit timer
	// FIXME: does TiemrValueGet() return 0 if timer is not on?
	long long restOfTimer = timerInterruptTimes * TIMER_ROLLOVER_CYCLES;
	restOfTimer += TimerValueGet(TIMER0_BASE, TIMER_A);

	if (restOfTimer <= 0) {
		// Timer not running. setup a new timer value and start timer.
	
		TimerConfigure(TIMER0_BASE, TIMER_CFG_32_BIT_OS);
	    // interrupt 10 times per second
	    TimerLoadSet(TIMER0_BASE, TIMER_BOTH, safeToProcessTime % TIMER_ROLLOVER_CYCLES);
		timerInterruptTimes = safeToProcessTime / TIMER_ROLLOVER_CYCLES;
	
		//
		//Setup the interrupts for the timer timeouts
		//
	    IntEnable(INT_TIMER0A);
		IntEnable(INT_TIMER0B);
		TimerIntEnable(TIMER0_BASE,TIMER_TIMA_TIMEOUT);
		//TimerIntEnable(TIMER0_BASE,TIMER_TIMB_TIMEOUT);
	
	    // Enable the timers.
	    //
	    TimerEnable(TIMER0_BASE, TIMER_BOTH);
		return;

	} else {
		// Timer already running, check to see if we need to reload timer value.
		if (restOfTimer > safeToProcessTime) {
			TimerDisable(TIMER0_BASE, TIMER_BOTH);
						
	    	TimerLoadSet(TIMER0_BASE, TIMER_BOTH, safeToProcessTime % TIMER_ROLLOVER_CYCLES);	
			timerInterruptTimes = safeToProcessTime / TIMER_ROLLOVER_CYCLES;

	    	TimerEnable(TIMER0_BASE, TIMER_BOTH);
		} // else we don't need to reload the timer.

	}
}

long long getCurrentPhysicalTime() 
{  // returns seconds elapsed.. number of times the counter has rolled over.
	return (seconds*8000000) + SysTickValueGet();
}

//*****************************************************************************
// FIXME: I need to decide what the UARET is really for, or maybe I should just get rid of it?
// The UART interrupt handler.
//
//*****************************************************************************
void UARTIntHandler(void)
{
    unsigned long ulStatus;
	Event* dummyEvent;
	
	disableInterrupts();

    //
    // Get the interrrupt status.
    //
    ulStatus = UARTIntStatus(UART0_BASE, true);
    //
    // Clear the asserted interrupts.
    //
    UARTIntClear(UART0_BASE, ulStatus);

	fireClock(SOURCE1, dummyEvent);

	enableInterrupts();
	
	processAvailableEvents();	

	// If processEvents() is currently trying
    // to fill the output buffer of source
    // actors, go back to the start of
    // while(TRUE) in processEvents().		
	STOP_SOURCE_PROCESS = TRUE;
}

//FIXME: which interrupt(s) should I disable/enable?
void disableInterrupts() {
	IntMasterDisable();
	//IntDisable(INT_UART0);
	//UARTIntDisable(UART0_BASE, UART_INT_RX | UART_INT_RT);
	return;
}

void enableInterrupts() {
	IntMasterEnable();
    //IntEnable(INT_UART0);
    //UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
	return;
} 



Event * newEvent(void)
{
RIT128x96x4StringDraw("bne",12,12,15);
//RIT128x96x4StringDraw(itoa(locationCounter,10), 30,12,15);
//printf("location counter is %d",locationCounter);
	while(eventMemory[locationCounter].inUse != 36 )
	{  
	   ASSERT(locationCounter != 35)  // if you've run out of memory just stop
	//  printf("locationCounter %d",locationCounter);
	   locationCounter++;
	}
	locationCounter%=35;  // make it circular
//	RIT128x96x4StringDraw(itoa(locationCounter,10), 0,0,15);
	return &eventMemory[locationCounter];
	
}

void freeEvent(Event * thisEvent)
{
	eventMemory[thisEvent->inUse].inUse = 36;

}
void initializeMemory()
{
	int i;
	locationCounter = 0;
						  
	for(i =0; i< 35; i++)
	{
	// event is "freed and can be returned by newEvent"
			eventMemory[i].inUse = 36; 
	}
}

/**
 * main() has the following functionalities:
 * declare all actors
 * setup dependencies between the actors
 * intialize actors
 */
int main(void)
{

    //**************************************************
    //Declare all actors
    Actor sensor1;
	Actor sensor2;
    Actor clock1;
	Actor computation1;
	Actor computation2;
	Actor computation3;
    Actor merge1;
    Actor model_delay1;
	Actor model_delay2;
    Actor model_delay3;
    Actor actuator1;
	locationCounter=0;

	/*************************************************************************/
	// Utilities to setup interrupts
    //
    // Enable the peripherals used by this example.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);

	//
    // Set the clocking to run directly from the crystal.
    //
    SysCtlClockSet(SYSCTL_SYSDIV_1 | SYSCTL_USE_OSC | SYSCTL_OSC_MAIN |
                   SYSCTL_XTAL_8MHZ);	   // 8MHZ is the fastest the clock can run.
	 //
    // Initialize the OLED display and write status.
    //
    RIT128x96x4Init(1000000);
    RIT128x96x4StringDraw("PtidyRTOSv0.1",            36,  0, 15);
  //  printf("PtidyRTOSv0.1\n");	

	//
    // Enable processor interrupts.
    //
    IntMasterEnable();	
    //
    // Set GPIO A0 and A1 as UART pins.
    //
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);
	//
    // Configure the UART for 115,200, 8-N-1 operation. 
	// FIXME: don't know what this is for...
    //
    UARTConfigSetExpClk(UART0_BASE, SysCtlClockGet(), 115200,
                        (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                         UART_CONFIG_PAR_NONE));
    //
    // Enable the UART interrupt.
    //
    IntEnable(INT_UART0);
    UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
	
	//setup and enable the SysTickTimer. It will be used as a reference for delay loops in interrupt handlers. 
	//The SysTick timer period will be set for one second
	SysTickPeriodSet(SysCtlClockGet());  
	SysTickEnable();
	IntEnable(15);  //sys tick vector

    //TimerEnable(TIMER1_BASE, TIMER_A);
//	RIT128x96x4StringDraw("beforeinit", 12,24,15);
	//IEEE1588Init();     //when this is uncommented I don't see the ouptut below..
	//RIT128x96x4StringDraw("AIEEEinit", 36,24,15);	   
	initializeMemory();
	
